package _01基本数据类型及运算符;

public class _14其他进制转十进制 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//1.二进制转十进制
		int n1 = 0b1011;//从最低位（右边）开始，将每个位上的数提取出来，乘以2的（位数-1)次方，然后求和
		//1*2的(1-1)次方+1*2的(2-1)次方+0*2的(3-1)次方+1*2的（4-1）次方=11
		System.out.println(n1);
		//-----------------------
		//2.八进制转十进制
		int n2 = 0234;//从最低位（右边）开始，将每个位上的数提取出来，乘以8的（位数-1)次方，然后求和
		//4*8^0+3*8^(2-1)+2*8^(3-1)+0*8^(4-1)=4*1+3*8+2*64+0*512=156
		System.out.println(n2);
		//---------------------------
		//3.十六进制转十进制
		int n3 = 0x23A;//从最低位（右边）开始，将每个位上的数提取出来，乘以16的（位数-1)次方，然后求和
		//16进制 1 2 3 4 5 6 7 8 9 A B C D E F
		//10*16^(1-1)+3*16^(2-1)+2*16^(3-1)=10+48+512=570
		System.out.println(n3);
		int t1=0b110001100,t2=023456,t3=0xA45;
		System.out.println(t1+"\n"+t2+"\n"+t3);
		
		
	}

}
